[
  {
    "uuid": "a9f1c6e5-9383-4d12-b28d-734c9370f861",
    "location": "Tbilisi, Georgia",
    "timeStamp": "20 Nov 2025 at 18:18",
    "title": "Pulp Fiction",
    "author": "Jack",
    "text": "Just watched Pulp Fiction for the first time, and wow—I’m blown away! The storytelling is wild, jumping around in time but somehow making perfect sense. The characters are unforgettable—Vincent and Jules are iconic, and the dialogues are so sharp and funny. The mix of violence, dark humor, and quirky moments kept me hooked the entire time. Tarantino’s style is unlike anything I’ve seen before; every scene feels alive. That twist with the briefcase, the dance scene, and all the little surprises… I didn’t expect it at all. Can’t stop thinking about it!"
  },
  {
    "uuid": "47e3291a-6f67-4fc0-9d06-25fa4d1f3ae1",
    "location": "Berlin, Germany",
    "timeStamp": "21 Nov 2025 at 15:18",
    "title": "Jaws",
    "author": "Sally",
    "text": "I finally watched Jaws, and honestly, I’m struggling to understand the hype. The movie felt slow and drawn-out, with long stretches of nothing happening while characters wander around the beach talking. The shark, which is supposed to be terrifying, is barely on screen, and when it does appear, the mechanical effects are so obvious it’s more laughable than scary. The suspense that everyone raves about just didn’t land for me; I kept waiting for a real sense of danger that never came. The dialogue often feels flat, and some of the acting is wooden, making it hard to connect with the characters. Even the famous “You’re gonna need a bigger boat” moment, while iconic, felt overhyped in the context of an otherwise tedious film. Overall, I found it slow, dated, and not particularly engaging—definitely not the thrilling experience I expected."
  },
  {
    "uuid": "b83cb7e0-df38-493b-b53d-2616175ea5f9",
    "location": "Dunwich, UK",
    "timeStamp": "23 Nov 2025 at 12:18",
    "title": "Love",
    "author": "Marry",
    "text": "I finally endured Gaspar Noé’s Love, and honestly, it felt like a test in frustration rather than cinema. The film’s obsession with prolonged, explicit sex scenes overshadows any real narrative or character development—there’s almost nothing to care about beyond surface-level physicality. The story, such as it is, jumps around confusingly, and the psychedelic editing and disorienting camera work only make it harder to follow, leaving you dizzy but not emotionally invested. Dialogue is minimal, and when it exists, it’s banal, adding nothing to the already thin plot. The “artistic” nudity feels gratuitous rather than meaningful, seemingly trying to shock instead of enhance the story. I get that Noé wants to provoke, but provocation alone isn’t enough to sustain a 135-minute runtime. By the end, I was exhausted, bored, and frankly unimpressed, wondering if the hype comes from style over substance. It’s a hollow, frustrating experience."
  },
  {
    "location": "Tbilisi, Georgia",
    "author": "Besiki",
    "title": "ცისფერი მთები",
    "text": "შედევრი.",
    "timeStamp": "Nov 20, 2025, 23:15"
  }
]